'use strict';

z.constant('languages',{
  en: function() {
    var english = {

	  'Title': 'Seenu - Raji Wedding',

    'H1': 'Home',
    'H2':'Couple',
    'H3': 'Love Story',
    'H4': 'People',
    'H5': 'Events',
    'H6': 'Gallery',
    'H7': 'RSVP',
    'H8': 'MAP',

      'Hero_Name': 'Seenu',
      'Heroine_Name':'Raji',
      'Label_Fun': 'A Wedding Shower',
      'Top_Quote': 'Wedding is a beautiful poem, where husband and wife are iti s release, The poem becomes meaningless, even if one lyrics is missed...',

      'HH1':'First Meet',
      'HH2':'Hello Hello',
      'HH3':'Love Gift',
      'HH4':'Happy Engagement',
      'HH5':'Engagement',
      'HH6':'Happy Moments',

      "rs2":"We are missing your present. Don’t be late no more.",

      'r11': 'Sankaran - Selvarani',
      'r12':'Groom Parents',
      'r13':'நாங்க ரொம்ப சந்தோசமா இருக்கோம் எங்க 2வது பையனுக்கு கல்யாணம். முதல் மருமக மாதிரி 2வது மருமகளும் நல்லபடியா அமைஞ்சுடுச்சு.  எங்க கடமையை எல்லாம் நல்லபடியா முடிச்சுட்டோம்னு நிம்மதியாக இருக்கோம்',

      'r21': 'Mariappan - Usha',
      'r22': 'Bride Parents' ,
      'r23': 'எங்க வீட்டு முதல் கல்யாணம் கொஞ்சம் படபடப்பு இருந்தாலும் ஒரு நல்ல குடும்பத்துல என் பொண்ணு வாழ போறான்னு நினைச்சு ரொம்ப சந்தோசமா இருக்கோம்',

      'r31': 'Nellai Nayagam - Raja Kumari',
      'r32': 'Groom Brother in law - Sister',
      'r41': 'Manthiram - Gomathi',
      'r42': 'Groom brother - Sister in law',

      'r33': '(அத்தான்) முதல்ல வேணாம்னு சொன்ன மாப்பிளை பொண்ண பார்த்துட்டு வந்த அப்புறம் அந்தர் பல்டி அடிச்சு டூயட் பாட ஆரம்பிச்சுட்டான்.என் மாப்பிளைக்கு நல்ல வாழ்க்கையும் எனக்கு ஒரு புது தங்கச்சியும் கிடைச்சுட்டானு ரொம்ப சந்தோசம். (தங்கச்சி)என் செல்ல அண்ணனுக்கு கல்யாணம் அவனுக்கு எப்போதும் நான்தான் செல்ல ராஜகுமாரி.ஆனா இப்போம் அவனுக்கான ராஜகுமாரி வந்தாச்சு. இனி அண்ண பாசத்தோட அண்ணி பாசமும் கிடைக்க பொது இந்த ராஜகுமாரிக்கு!!!',
      'r43': '(அண்ணன்) என் தம்பிக்கு பெஸ்ட் வாழ்க்கை கிடைச்சதுல ரொம்ப ரொம்ப சந்தோசம், கோமதி வந்த அப்புறம் எங்க வீட்ல நடக்க போற முதல் பெரிய விழா, அதுனால  நாங்க ரொம்ப ஜாலியாவும் இருக்கோம்.. (அண்ணி) இவ்ளோ நாள் அண்ணியா பார்த்துக்கிட்ட எனக்கு இப்போம் அக்காங்கிற பதவி உயர்வு கிடைச்சாச்சு.',

      'r51': 'Arun Kalyan',
      'r52': 'Bride Brother',
      'r53': 'இவ்ளோ நாள் அக்காகிட்ட  மாட்டிகிட்டு இருந்த நான் இப்போம் தப்புச்சிட்டன், ஆனா அத்தான் அவங்களா வந்து இப்படி மாட்டிக்கிட்டாங்க. அவளை நீங்க பார்த்துகிறதவிட, உங்கள நீங்க அவட்ட இருந்து பத்திரமா பார்த்துக்கோங்க அத்தான். என்னதான் இப்படி விளையாட்ட பேசுனாலும் நிஜமா அவளை தேடும், சண்டை போட இனி ஆள் இருக்காதுலா...',

      'e0':'இதயங்கள் இணைகையில் இனிமைகள் வாழ்விலே! உன் இதயமும் என் இதயமும் ஒன்றாக சேரட்டுமே !.....',
      'e1':'Wedding Ceremony',
      'e2':'Wedding Celebration',
      'e3':'Reception',
      'edate':'Sep 4',


      'Second_Heading': 'Groom & Bride',
      'Line_One':'We Are Getting Married',
      'Sub_Quote': ' “Where there is love there is life.”',
      'Label_Hero': 'Hero',
      'Label_Heroine': 'Heroine',
      'Label_Day': 'Marriage Date',
      'Mrg_Day': 'May 16',
      'Label_Invitaiton': 'Invitation',
      'Labe_U': 'For U Only',
      'Label_Description': 'We are getting married together in the presence of our parents and with joyful hearts.You are invited to share in the happiness as we join our lives in marriage on Monday,16 th May 2016 between 9.00 a.m and 10.00 a.m.',
      'Label_Address' : 'Address',
      'Label_venue'  :  'JPR Marriage Hall',
      'Label_Location' : 'Palayamkottai',
      'Label_District': 'Tirunelveli - 627002',
      'Footer':'With regard Friends & Relatives...',
};


    return english;
  },


  ml: function() {
    var malayalam = {

	'Title': 'மந்திரம்-கோமதி திருமணம்',

	    'H1': 'Home',
      'H2':'Couple',
      'H3': 'Love Story',
      'H4': 'People',
      'H5': 'Events',
      'H6': 'Gallery',
      'H7': 'RSVP',
      'H8': 'MAP',


      'Hero_Name': 'Manthiram',
      'Heroine_Name':'Gomathy',
      'Label_Fun': 'വിവാഹം',
      'Top_Quote': 'വരുവിൻ നാം നേരുന്നു.',

      'Second_Heading': 'വരന് & മണവാട്ടി',
      'Line_One':'ഞങ്ങൾ ആകുന്നു',
      'Sub_Quote': 'വിവാഹം കഴിക്കാൻ പോകുന്നു',
      'Label_Hero': 'കഥാനായകന്',
      'Label_Heroine': 'നായികമാരിൽ',
      'Label_Day': 'വിവാഹ തീയതി',
      'Mrg_Day': 'മേയ് 16',
      'Label_Invitaiton': 'ക്ഷണം',
      'Labe_U': 'നിനക്കായ് മാത്രം...!',
      'Label_Description': 'marriage date and further',
      'Label_Address' : 'വിലാസം',
      'Label_venue'  :  'JPR കല്യാണമണ്ഡപം',
      'Label_Location' : 'Palayamkottai',
      'Label_District': 'Tirunelveli - 627002',
      'Footer':'அவ்வண்மை விரும்பும் சுற்றமும் நட்பும்'
};


    return malayalam;
  },
  tn: function(){
    var tamil = {

	  'Title': 'சீனு - ராஜீ திருமணம்',

	    'H1': 'முகப்பு',
      'H2':'மணமக்கள்',
      'H3': 'காதல் கதை',
      'H4': 'உறவினர்கள்',
      'H5': 'திருமண நிகழ்வுகள்',
      'H6': 'மலரும் நினைவுகள்',
      'H7': 'பதிலளிக்க',
      'H8': 'வரைப்படம்',

      'Hero_Name': 'சீனு',
      'Heroine_Name':'ராஜீ',
      'Label_Fun': 'கல்யாண திருவிழா',
      'Top_Quote': 'என்னோடு நீ உன்னோடு நான், ஒன்றோடு நாம் ஒன்றாகும் நாள்! என்னோடு நீ உன்னோடு நான், ஒன்றாகும் நாள்..! '+
      '\n இந்நாளும் எந்நாளும், கை கோர்த்துப் போகும் பாதை, கண்ணில் தோன்றுதே! சொல்லாமல் கொள்ளாமல், நெஞ்சோடு காதல் சேர, மூச்சு முட்டுதே!', //'வாழ்த்துவோம் வாங்க',

      'Second_Heading': 'மணமக்கள்',
      'groom_intro':'இவர்தாங்க நம்ம மாப்பிள்ளை பேரு சீனு. இவருக்குத்தான் டும் டும் டும் பீ பீ பீ. திருநெல்வேலி பையன்தான் வீட்டுக்கு செல்ல பிள்ளை , சில சமயம் வீட்டு பேச்சை கேக்குற நல்ல பிள்ளை. அப்பிடி கேட்டுத்தான் சிவகிரிக்கு பொண்ணு பாக்க போயி அங்க அவன் மனசு பண்ணின சேட்டைனால இப்போ சிவகிரிக்கு மாப்பிளையாக போறான்',
      'bride_intro':'இவங்கதான் நம்ம மாப்பிளைய சிரிச்சு கவுத்த சிவகிரி பொண்ணு பேரு ராஜீ. இவர்களுக்கும் சீனுக்கும்தான் டும் டும் டும் பீ பீ பீ. வீட்டுக்கு முதல் பொண்ணு அதுனால கேக்கவா செய்யணும் செல்லம் ரொம்ப ஜாஸ்திதான். இவங்களுக்கு நம்ம மாப்பிளையை பிடிச்சனால திருநெல்வேலிக்கு மருமகளாக வர போறா',
      'h3_head':'ஒவ்வொரு காதல் கதையும் ரொம்ப அழகானது ஆனா எங்க கதை எங்களுக்கு ரொம்ப ரொம்ப பிடிச்சது.எங்க கல்யாணம் வீட்ல எல்லாரும் பேசி, எங்க ரெண்டு பேரோட வாழ்க்கைத் துணைங்கிற கேள்விக்கு இதுதான் பொண்ணு இதுதான் மாப்பிள்ளைன்னு அவங்களே பதில் எழுதிட்டாங்க, அதுக்கு அப்புறமாதாங்க நாங்க ஆரம்பிச்சோம் எங்க காதல் கதையை !!!.',
      'first_meet':'ரெண்டு குடும்பத்துக்கும் எங்கள பிடிச்சதால, அடுத்து  பொண்ணு பாக்குற நாளா இல்லாம அது எங்க முதல் சந்திப்பாயிடுச்சு. எங்க ரெண்டுபேருக்கும் ஒரே குழப்பம் , எனக்கு அவள் எப்பிடி இருக்க போறான்னும்? அவளுக்கு என்னை பிடிக்குமானு கேள்விலதான் நாங்க  ஹலோ ஹாய்னு ஆரம்பிச்சோம். எங்க பேச்சு முடிவுல நான் ராஜீயோட சிரிப்புல விழுந்தேன், அவ என்னோட பேச்சுல விழுந்துட்டா',
      'phone_conv':'நேர்ல பேசுனா அப்புறம் ரெண்டு பேருக்கும் பிடிச்சு போச்சு, அதுக்கப்புறமா நான் அடுத்த வேலைய ஆரம்பிச்ச, அது என்னன்னா கஷ்டப்பட்டு உன்  மொபைல் நம்பர வாங்கிருக்கேன்னு சொன்னா, "அப்பம்  சொல்ரா உங்க நம்பர் ஏற்கனவே எண்ட இருக்குனு, அப்பம ஏன் பேசலனு கேட்டா, உங்க மெசேஜ்க்குதான் காத்துட்டு இருக்கன்னு சொல்ற". அப்பதான் புரிஞ்சுது  இப்டி சுத்த விடறாளேனு, அதுக்கு அப்புறம் யோசிச்சன்  "ஐய்யோ கடவுளே நாம இவளை எப்படி சமாளிக்க போறன்னு"',
      'gift':'என்னதான் நம்பர் வாங்குனாலும், எங்களுக்கு சிவகிரில வோடோபோன் சிக்னல் எல்லாம் விரோதியா இருந்துச்சு, பேசுறப்பம்ல பாதி நேரம் கேக்குதா கேக்குதானே கேட்டு நேரம் போச்சு. அதுனால நான் ஒரு மொபைல் வாங்கி அதுல ஒரு புது சிம் சேர்த்து கொடுத்தேன் , அவ எனக்கும் மேல யோசிச்சு நான் நேரத்துக்கு பேசணுமேனு  ஒரு கை கடிகாரம் கொடுத்தா...',
      'engagement':'கடைசியா நாங்க எதிர் பார்த்த நாளும் வந்துச்சு, அதான் எங்க நிச்சயதார்த்தம்தான். செப்டம்பர் 4 கல்யாணம்னு முடிவு பண்ணி அறிவிச்சாங்க, எல்லாரும் செம சந்தோசமா இருந்தாங்க நாங்களும்தான் , மாத்தி மாத்தி பரிசு குடுத்துகுட்டோம், இந்த மகிழ்ச்சியான தருணத்தை அழகான நினைவுகளை மாற்ற, புகைப்படம் எல்லாம் எடுத்தோம்.',
      'HH1':'முதல் சந்திப்பு ',
      'HH2':'ஹலோ ஹலோ',
      'HH3':'காதல் பரிசு',
      'HH4':'இனிய நிச்சயதார்த்தம்',
      'HH5':'நிச்சயதார்த்தம்',
      'HH6':'மகிழ்ச்சியான தருணம்',



'r11': 'சங்கரன் - செல்வராணி',
'r12':'சீனு பெற்றோர்கள்',
'r13':'நாங்க ரொம்ப சந்தோசமா இருக்கோம் எங்க 2வது பையனுக்கு கல்யாணம். முதல் மருமக மாதிரி 2வது மருமகளும் நல்லபடியா அமைஞ்சுடுச்சு.  எங்க கடமையை எல்லாம் நல்லபடியா முடிச்சுட்டோம்னு நிம்மதியாக இருக்கோம்',

'r21': 'மாரியப்பன் - உஷா',
'r22': 'ராஜீ பெற்றோர்கள்' ,
'r23': 'எங்க வீட்டு முதல் கல்யாணம் கொஞ்சம் படபடப்பு இருந்தாலும் ஒரு நல்ல குடும்பத்துல என் பொண்ணு வாழ போறான்னு நினைச்சு ரொம்ப சந்தோசமா இருக்கோம்',

'r31': 'நெல்லைநாயகம் - ராஜகுமாரி',
'r32': 'அத்தான் - தங்கை',
'r41': 'மந்திரம் - கோமதி',
'r42': 'அண்ணன் - அண்ணி',

'r33': '(அத்தான்) முதல்ல வேணாம்னு சொன்ன மாப்பிளை பொண்ண பார்த்துட்டு வந்த அப்புறம் அந்தர் பல்டி அடிச்சு டூயட் பாட ஆரம்பிச்சுட்டான்.என் மாப்பிளைக்கு நல்ல வாழ்க்கையும் எனக்கு ஒரு புது தங்கச்சியும் கிடைச்சுட்டானு ரொம்ப சந்தோசம். (தங்கச்சி)என் செல்ல அண்ணனுக்கு கல்யாணம் அவனுக்கு எப்போதும் நான்தான் செல்ல ராஜகுமாரி.ஆனா இப்போம் அவனுக்கான ராஜகுமாரி வந்தாச்சு. இனி அண்ண பாசத்தோட அண்ணி பாசமும் கிடைக்க பொது இந்த ராஜகுமாரிக்கு!!!',
'r43': '(அண்ணன்) என் தம்பிக்கு பெஸ்ட் வாழ்க்கை கிடைச்சதுல ரொம்ப ரொம்ப சந்தோசம், கோமதி வந்த அப்புறம் எங்க வீட்ல நடக்க போற முதல் பெரிய விழா, அதுனால  நாங்க ரொம்ப ஜாலியாவும் இருக்கோம்.. (அண்ணி) இவ்ளோ நாள் அண்ணியா பார்த்துக்கிட்ட எனக்கு இப்போம் அக்காங்கிற பதவி உயர்வு கிடைச்சாச்சு.',

'r51': ' அருண் கல்யாண்',
'r52': 'சகோதரன்',
'r53': 'இவ்ளோ நாள் அக்காகிட்ட  மாட்டிகிட்டு இருந்த நான் இப்போம் தப்புச்சிட்டன், ஆனா அத்தான் அவங்களா வந்து இப்படி மாட்டிக்கிட்டாங்க. அவளை நீங்க பார்த்துகிறதவிட, உங்கள நீங்க அவட்ட இருந்து பத்திரமா பார்த்துக்கோங்க அத்தான். என்னதான் இப்படி விளையாட்ட பேசுனாலும் நிஜமா அவளை தேடும், சண்டை போட இனி ஆள் இருக்காதுலா...',

'e0':'இதயங்கள் இணைகையில் இனிமைகள் வாழ்விலே! உன் இதயமும் என் இதயமும் ஒன்றாக சேரட்டுமே !.....',
'e1':'திருமண வைபவம்',
'e2':'திருமண கொண்டாட்டம்',
'e3':'மாலை வரவேற்பு மற்றும் நலுங்கு',
'edate':'செப்டம்பர் 4',

'e11':'இந்த செப்டம்பர் மாசம் 4ஆம் தேதி திங்ககிழம காலையிலே 6.00 மணிக்கு மேல 7.25 மணிக்குள்ள எங்களுக்கு கல்யாணம். பாசமா கூப்பிடுறோம். குடும்பமா வாங்க. வாழ்த்துக்களையும் ஆசிகளையும் தாங்க. \n\n\n இடம்: சிவா கல்யாண மண்டபம், தென்காசி.',
'e12':'எங்க கல்யாணத்தோட சந்தோசத்தை குழந்தைகள் கூடவும், பெரியவங்க கூடவும், கொண்டாடி அவங்க ஆசீர்வாதம் பெற்று, நாங்க எங்க வாழ்க்கையின் அத்தியாயம் இனிதே துவக்குறோம். \n\n\n இடம்: பிரணவ் ஆசிரமம், குற்றாலம்.',
'e13':'நெற்றியில்  திலகம் துலங்கிட பற்றிய கைவளையல்கள் குளுங்கிட சுற்றிலும் உள்ளவர்வகள் மகிழ்ந்திட பெற்றவர்கள் உள்ளம் குளிர்ந்திட சீனுராஜி யின் காதல் விளையாட்டு இனிதே ஆரம்பம்..\n வரவேற்பு மாலை 6 மணி முதல் 7 மணி வரை. நலுங்கு 7 மணிக்கு மேல். \n இடம்: சிவா கல்யாண மண்டபம், தென்காசி.',

"rs1":"காதலும் கவிதையுமான சங்கமம், நேசித்த இரு மனங்களின் வாழ்வினுக்கான காதல் துவக்கம். \n இனிய விடியலாய்  திருமண விழாக்கோலம், இனி வாழும் வாழ்வே விழா காணும்.",
"rs2":"எங்களின் சந்தோஷத்தை  பகிரவும், உங்களது வாழ்த்துக்களையும், ஆசிகளையும் பெறுவதற்கான நம் சந்திப்பு இனிமையாக நிகழ, கீழே மறக்காமல் பதில் அளிக்கவும்.",
"rs3":"மகிழ்வான தருணங்கள் மலர்ந்தது இனிமையாக... நெகிழ்வான இரு குடும்பங்கள் இணைந்தது பாசமாக...",
"rs4":"அன்பாய் பார்த்து கொள்ள நீயும், அக்கறையாக பார்த்து கொள்ள அவளும், திருமணத்தில் வாழ்த்துக்களை சுமந்து பூக்களாய் தூவி வாழ்த்துகிறோம்...",
"rs5":"எங்களின் மகிழ்வான தருணங்கள் உங்கள் வருகையால் மலரட்டும் இனிமையாக, நெகிழ்வான நேசங்கள் நிகழட்டும் இளமையாக !... \n  எங்கள் திருமண விழாவை அலங்கரிக்க உங்களை அன்போடு அழைக்கிறோம். உங்களது வருகையை மறக்காமல் இங்கு பதிவு செய்யவும்",

"fng_title":"விருந்தினர் எண்ணிக்கை",
"fng1":"1 நபர்",
"fng2":"2 நபர்",
"fng3":"3 நபர்",
"fng4":"4 நபர்",

"fe_title":"நீங்கள் கலந்து கொள்ளும் விழா",
"fe1":"அனைத்தும்",
"fe2":"திருமண வைபவம்",
"fe3":"திருமண கொண்டாட்டம்",
"fe4":"மாலை வரவேற்பு மற்றும் நலுங்கு",
"i_am_attend":"நான் கலந்து கொள்கிறேன்",
"name_placeholder":"பெயர்",
"msg_placeholder":"தகவல்",

      'Line_One':'நாங்க தான்',
      'Sub_Quote': 'கல்யாணம் எங்களுக்கு தான்.',
      'Label_Hero': 'நாயகன்',
      'Label_Heroine': 'நாயகி',
      'Label_Day': 'மண நாள்',
      'Mrg_Day': 'மே 16',
      'Label_Invitaiton': 'அழைப்பிதழ்',
      'Labe_U': 'உங்களுக்கு தான்',
      'Label_Description': 'இந்த மே மாசம் 16ஆம் தேதி திங்ககிழம காலையிலே 9 மணிக்கு மேல 10 மணிக்குள்ள எங்களுக்கு கல்யாணம். சாயும்காலம் 6 மணில இருந்து 8 மணிக்குள்ள வரவேற்ப்பு நடக்கபோகுது. பாசமா கூப்பிடுறோம். குடும்பமா வாங்க. வாழ்த்துக்களையும் ஆசிகளையும் தாங்க.',
      'Label_Address' : 'முகவரி',
      'Label_venue'  :  'JPR திருமண மண்டபம்',
      'Label_Location' : 'பாளையங்கோட்டை',
      'Label_District': 'திருநெல்வேலி - 627002' ,
	  'Footer':'அவ்வண்மை விரும்பும் சுற்றமும் நட்பும்...',
    };
    return tamil;
  }
});
